GopalSaraf/Practicals/PSDL/include/proc/pic18lf8393.inc
// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
LCDDATA6                                 equ 0F66h
// bitfield definitions
LCDDATA6_LCDDATA6_POSN                   equ 0000h
LCDDATA6_LCDDATA6_POSITION               equ 0000h
LCDDATA6_LCDDATA6_SIZE                   equ 0008h
LCDDATA6_LCDDATA6_LENGTH                 equ 0008h
LCDDATA6_LCDDATA6_MASK                   equ 00FFh
LCDDATA6_S0C1_POSN                       equ 0000h
LCDDATA6_S0C1_POSITION                   equ 0000h
LCDDATA6_S0C1_SIZE                       equ 0001h
LCDDATA6_S0C1_LENGTH                     equ 0001h
LCDDATA6_S0C1_MASK                       equ 0001h
LCDDATA6_S1C1_POSN                       equ 0001h
LCDDATA6_S1C1_POSITION                   equ 0001h
LCDDATA6_S1C1_SIZE                       equ 0001h
LCDDATA6_S1C1_LENGTH                     equ 0001h
LCDDATA6_S1C1_MASK                       equ 0002h
LCDDATA6_S2C1_POSN                       equ 0002h
LCDDATA6_S2C1_POSITION                   equ 0002h
LCDDATA6_S2C1_SIZE                       equ 0001h
LCDDATA6_S2C1_LENGTH                     equ 0001h
LCDDATA6_S2C1_MASK                       equ 0004h
LCDDATA6_S3C1_POSN                       equ 0003h
LCDDATA6_S3C1_POSITION                   equ 0003h
LCDDATA6_S3C1_SIZE                       equ 0001h
LCDDATA6_S3C1_LENGTH                     equ 0001h
LCDDATA6_S3C1_MASK                       equ 0008h
LCDDATA6_S4C1_POSN                       equ 0004h
LCDDATA6_S4C1_POSITION                   equ 0004h
LCDDATA6_S4C1_SIZE                       equ 0001h
LCDDATA6_S4C1_LENGTH                     equ 0001h
LCDDATA6_S4C1_MASK                       equ 0010h
LCDDATA6_S5C1_POSN                       equ 0005h
LCDDATA6_S5C1_POSITION                   equ 0005h
LCDDATA6_S5C1_SIZE                       equ 0001h
LCDDATA6_S5C1_LENGTH                     equ 0001h
LCDDATA6_S5C1_MASK                       equ 0020h
LCDDATA6_S6C1_POSN                       equ 0006h
LCDDATA6_S6C1_POSITION                   equ 0006h
LCDDATA6_S6C1_SIZE                       equ 0001h
LCDDATA6_S6C1_LENGTH                     equ 0001h
LCDDATA6_S6C1_MASK                       equ 0040h
LCDDATA6_S7C1_POSN                       equ 0007h
LCDDATA6_S7C1_POSITION                   equ 0007h
LCDDATA6_S7C1_SIZE                       equ 0001h
LCDDATA6_S7C1_LENGTH                     equ 0001h
LCDDATA6_S7C1_MASK                       equ 0080h
LCDDATA6_SEG0COM1_POSN                   equ 0000h
LCDDATA6_SEG0COM1_POSITION               equ 0000h
LCDDATA6_SEG0COM1_SIZE                   equ 0001h
LCDDATA6_SEG0COM1_LENGTH                 equ 0001h
LCDDATA6_SEG0COM1_MASK                   equ 0001h
LCDDATA6_SEG1COM1_POSN                   equ 0001h
LCDDATA6_SEG1COM1_POSITION               equ 0001h
LCDDATA6_SEG1COM1_SIZE                   equ 0001h
LCDDATA6_SEG1COM1_LENGTH                 equ 0001h
LCDDATA6_SEG1COM1_MASK                   equ 0002h
LCDDATA6_SEG2COM1_POSN                   equ 0002h
LCDDATA6_SEG2COM1_POSITION               equ 0002h
LCDDATA6_SEG2COM1_SIZE                   equ 0001h
LCDDATA6_SEG2COM1_LENGTH                 equ 0001h
LCDDATA6_SEG2COM1_MASK                   equ 0004h
LCDDATA6_SEG3COM1_POSN                   equ 0003h
LCDDATA6_SEG3COM1_POSITION               equ 0003h
LCDDATA6_SEG3COM1_SIZE                   equ 0001h
LCDDATA6_SEG3COM1_LENGTH                 equ 0001h
LCDDATA6_SEG3COM1_MASK                   equ 0008h
LCDDATA6_SEG4COM1_POSN                   equ 0004h
LCDDATA6_SEG4COM1_POSITION               equ 0004h
LCDDATA6_SEG4COM1_SIZE                   equ 0001h
LCDDATA6_SEG4COM1_LENGTH                 equ 0001h
LCDDATA6_SEG4COM1_MASK                   equ 0010h
LCDDATA6_SEG5COM1_POSN                   equ 0005h
LCDDATA6_SEG5COM1_POSITION               equ 0005h
LCDDATA6_SEG5COM1_SIZE                   equ 0001h
LCDDATA6_SEG5COM1_LENGTH                 equ 0001h
LCDDATA6_SEG5COM1_MASK                   equ 0020h
LCDDATA6_SEG6COM1_POSN                   equ 0006h
LCDDATA6_SEG6COM1_POSITION               equ 0006h
LCDDATA6_SEG6COM1_SIZE                   equ 0001h
LCDDATA6_SEG6COM1_LENGTH                 equ 0001h
LCDDATA6_SEG6COM1_MASK                   equ 0040h
LCDDATA6_SEG7COM1_POSN                   equ 0007h
LCDDATA6_SEG7COM1_POSITION               equ 0007h
LCDDATA6_SEG7COM1_SIZE                   equ 0001h
LCDDATA6_SEG7COM1_LENGTH                 equ 0001h
LCDDATA6_SEG7COM1_MASK                   equ 0080h
LCDDATA6_S00C1_POSN                      equ 0000h
LCDDATA6_S00C1_POSITION                  equ 0000h
LCDDATA6_S00C1_SIZE                      equ 0001h
LCDDATA6_S00C1_LENGTH                    equ 0001h
LCDDATA6_S00C1_MASK                      equ 0001h
LCDDATA6_S01C1_POSN                      equ 0001h
LCDDATA6_S01C1_POSITION                  equ 0001h
LCDDATA6_S01C1_SIZE                      equ 0001h
LCDDATA6_S01C1_LENGTH                    equ 0001h
LCDDATA6_S01C1_MASK                      equ 0002h
LCDDATA6_S02C1_POSN                      equ 0002h
LCDDATA6_S02C1_POSITION                  equ 0002h
LCDDATA6_S02C1_SIZE                      equ 0001h
LCDDATA6_S02C1_LENGTH                    equ 0001h
LCDDATA6_S02C1_MASK                      equ 0004h
LCDDATA6_S03C1_POSN                      equ 0003h
LCDDATA6_S03C1_POSITION                  equ 0003h
LCDDATA6_S03C1_SIZE                      equ 0001h
LCDDATA6_S03C1_LENGTH                    equ 0001h
LCDDATA6_S03C1_MASK                      equ 0008h
LCDDATA6_S04C1_POSN                      equ 0004h
LCDDATA6_S04C1_POSITION                  equ 0004h
LCDDATA6_S04C1_SIZE                      equ 0001h
LCDDATA6_S04C1_LENGTH                    equ 0001h
LCDDATA6_S04C1_MASK                      equ 0010h
LCDDATA6_S05C1_POSN                      equ 0005h
LCDDATA6_S05C1_POSITION                  equ 0005h
LCDDATA6_S05C1_SIZE                      equ 0001h
LCDDATA6_S05C1_LENGTH                    equ 0001h
LCDDATA6_S05C1_MASK                      equ 0020h
LCDDATA6_S06C1_POSN                      equ 0006h
LCDDATA6_S06C1_POSITION                  equ 0006h
LCDDATA6_S06C1_SIZE                      equ 0001h
LCDDATA6_S06C1_LENGTH                    equ 0001h
LCDDATA6_S06C1_MASK                      equ 0040h
LCDDATA6_S07C1_POSN                      equ 0007h
LCDDATA6_S07C1_POSITION                  equ 0007h
LCDDATA6_S07C1_SIZE                      equ 0001h
LCDDATA6_S07C1_LENGTH                    equ 0001h
LCDDATA6_S07C1_MASK                      equ 0080h

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
LCDDATA7                                 equ 0F67h
// bitfield definitions
LCDDATA7_LCDDATA7_POSN                   equ 0000h
LCDDATA7_LCDDATA7_POSITION               equ 0000h
LCDDATA7_LCDDATA7_SIZE                   equ 0008h
LCDDATA7_LCDDATA7_LENGTH                 equ 0008h
LCDDATA7_LCDDATA7_MASK                   equ 00FFh
LCDDATA7_S8C1_POSN                       equ 0000h
LCDDATA7_S8C1_POSITION                   equ 0000h
LCDDATA7_S8C1_SIZE                       equ 0001h
LCDDATA7_S8C1_LENGTH                     equ 0001h
LCDDATA7_S8C1_MASK                       equ 0001h
LCDDATA7_S9C1_POSN                       equ 0001h
LCDDATA7_S9C1_POSITION                   equ 0001h
LCDDATA7_S9C1_SIZE                       equ 0001h
LCDDATA7_S9C1_LENGTH                     equ 0001h
LCDDATA7_S9C1_MASK                       equ 0002h
LCDDATA7_S10C1_POSN                      equ 0002h
LCDDATA7_S10C1_POSITION                  equ 0002h
LCDDATA7_S10C1_SIZE                      equ 0001h
LCDDATA7_S10C1_LENGTH                    equ 0001h
LCDDATA7_S10C1_MASK                      equ 0004h
LCDDATA7_S11C1_POSN                      equ 0003h
LCDDATA7_S11C1_POSITION                  equ 0003h
LCDDATA7_S11C1_SIZE                      equ 0001h
LCDDATA7_S11C1_LENGTH                    equ 0001h
LCDDATA7_S11C1_MASK                      equ 0008h
LCDDATA7_S12C1_POSN                      equ 0004h
LCDDATA7_S12C1_POSITION                  equ 0004h
LCDDATA7_S12C1_SIZE                      equ 0001h
LCDDATA7_S12C1_LENGTH                    equ 0001h
LCDDATA7_S12C1_MASK                      equ 0010h
LCDDATA7_S13C1_POSN                      equ 0005h
LCDDATA7_S13C1_POSITION                  equ 0005h
LCDDATA7_S13C1_SIZE                      equ 0001h
LCDDATA7_S13C1_LENGTH                    equ 0001h
LCDDATA7_S13C1_MASK                      equ 0020h
LCDDATA7_S14C1_POSN                      equ 0006h
LCDDATA7_S14C1_POSITION                  equ 0006h
LCDDATA7_S14C1_SIZE                      equ 0001h
LCDDATA7_S14C1_LENGTH                    equ 0001h
LCDDATA7_S14C1_MASK                      equ 0040h
LCDDATA7_S15C1_POSN                      equ 0007h
LCDDATA7_S15C1_POSITION                  equ 0007h
LCDDATA7_S15C1_SIZE                      equ 0001h
LCDDATA7_S15C1_LENGTH                    equ 0001h
LCDDATA7_S15C1_MASK                      equ 0080h
LCDDATA7_SEG8COM1_POSN                   equ 0000h
LCDDATA7_SEG8COM1_POSITION               equ 0000h
LCDDATA7_SEG8COM1_SIZE                   equ 0001h
LCDDATA7_SEG8COM1_LENGTH                 equ 0001h
LCDDATA7_SEG8COM1_MASK                   equ 0001h
LCDDATA7_SEG9COM1_POSN                   equ 0001h
LCDDATA7_SEG9COM1_POSITION               equ 0001h
LCDDATA7_SEG9COM1_SIZE                   equ 0001h
LCDDATA7_SEG9COM1_LENGTH                 equ 0001h
LCDDATA7_SEG9COM1_MASK                   equ 0002h
LCDDATA7_SEG10COM1_POSN                  equ 0002h
LCDDATA7_SEG10COM1_POSITION              equ 0002h
LCDDATA7_SEG10COM1_SIZE                  equ 0001h
LCDDATA7_SEG10COM1_LENGTH                equ 0001h
LCDDATA7_SEG10COM1_MASK                  equ 0004h
LCDDATA7_SEG11COM1_POSN                  equ 0003h
LCDDATA7_SEG11COM1_POSITION              equ 0003h
LCDDATA7_SEG11COM1_SIZE                  equ 0001h
LCDDATA7_SEG11COM1_LENGTH                equ 0001h
LCDDATA7_SEG11COM1_MASK                  equ 0008h
LCDDATA7_SEG12COM1_POSN                  equ 0004h
LCDDATA7_SEG12COM1_POSITION              equ 0004h
LCDDATA7_SEG12COM1_SIZE                  equ 0001h
LCDDATA7_SEG12COM1_LENGTH                equ 0001h
LCDDATA7_SEG12COM1_MASK                  equ 0010h
LCDDATA7_SEG13COM1_POSN                  equ 0005h
LCDDATA7_SEG13COM1_POSITION              equ 0005h
LCDDATA7_SEG13COM1_SIZE                  equ 0001h
LCDDATA7_SEG13COM1_LENGTH                equ 0001h
LCDDATA7_SEG13COM1_MASK                  equ 0020h
LCDDATA7_SEG14COM1_POSN                  equ 0006h
LCDDATA7_SEG14COM1_POSITION              equ 0006h
LCDDATA7_SEG14COM1_SIZE                  equ 0001h
LCDDATA7_SEG14COM1_LENGTH                equ 0001h
LCDDATA7_SEG14COM1_MASK                  equ 0040h
LCDDATA7_SEG15COM1_POSN                  equ 0007h
LCDDATA7_SEG15COM1_POSITION              equ 0007h
LCDDATA7_SEG15COM1_SIZE                  equ 0001h
LCDDATA7_SEG15COM1_LENGTH                equ 0001h
LCDDATA7_SEG15COM1_MASK                  equ 0080h
LCDDATA7_S08C1_POSN                      equ 0000h
LCDDATA7_S08C1_POSITION                  equ 0000h
LCDDATA7_S08C1_SIZE                      equ 0001h
LCDDATA7_S08C1_LENGTH                    equ 0001h
LCDDATA7_S08C1_MASK                      equ 0001h
LCDDATA7_S09C1_POSN                      equ 0001h
LCDDATA7_S09C1_POSITION                  equ 0001h
LCDDATA7_S09C1_SIZE                      equ 0001h
LCDDATA7_S09C1_LENGTH                    equ 0001h
LCDDATA7_S09C1_MASK                      equ 0002h

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
LCDDATA8                                 equ 0F68h
// bitfield definitions
LCDDATA8_LCDDATA8_POSN                   equ 0000h
LCDDATA8_LCDDATA8_POSITION               equ 0000h
LCDDATA8_LCDDATA8_SIZE                   equ 0008h
LCDDATA8_LCDDATA8_LENGTH                 equ 0008h
LCDDATA8_LCDDATA8_MASK                   equ 00FFh
LCDDATA8_S16C1_POSN                      equ 0000h
LCDDATA8_S16C1_POSITION                  equ 0000h
LCDDATA8_S16C1_SIZE                      equ 0001h
LCDDATA8_S16C1_LENGTH                    equ 0001h
LCDDATA8_S16C1_MASK                      equ 0001h
LCDDATA8_S17C1_POSN                      equ 0001h
LCDDATA8_S17C1_POSITION                  equ 0001h
LCDDATA8_S17C1_SIZE                      equ 0001h
LCDDATA8_S17C1_LENGTH                    equ 0001h
LCDDATA8_S17C1_MASK                      equ 0002h
LCDDATA8_S18C1_POSN                      equ 0002h
LCDDATA8_S18C1_POSITION                  equ 0002h
LCDDATA8_S18C1_SIZE                      equ 0001h
LCDDATA8_S18C1_LENGTH                    equ 0001h
LCDDATA8_S18C1_MASK                      equ 0004h
LCDDATA8_S19C1_POSN                      equ 0003h
LCDDATA8_S19C1_POSITION                  equ 0003h
LCDDATA8_S19C1_SIZE                      equ 0001h
LCDDATA8_S19C1_LENGTH                    equ 0001h
LCDDATA8_S19C1_MASK                      equ 0008h
LCDDATA8_S20C1_POSN                      equ 0004h
LCDDATA8_S20C1_POSITION                  equ 0004h
LCDDATA8_S20C1_SIZE                      equ 0001h
LCDDATA8_S20C1_LENGTH                    equ 0001h
LCDDATA8_S20C1_MASK                      equ 0010h
LCDDATA8_S21C1_POSN                      equ 0005h
LCDDATA8_S21C1_POSITION                  equ 0005h
LCDDATA8_S21C1_SIZE                      equ 0001h
LCDDATA8_S21C1_LENGTH                    equ 0001h
LCDDATA8_S21C1_MASK                      equ 0020h
LCDDATA8_S22C1_POSN                      equ 0006h
LCDDATA8_S22C1_POSITION                  equ 0006h
LCDDATA8_S22C1_SIZE                      equ 0001h
LCDDATA8_S22C1_LENGTH                    equ 0001h
LCDDATA8_S22C1_MASK                      equ 0040h
LCDDATA8_S23C1_POSN                      equ 0007h
LCDDATA8_S23C1_POSITION                  equ 0007h
LCDDATA8_S23C1_SIZE                      equ 0001h
LCDDATA8_S23C1_LENGTH                    equ 0001h
LCDDATA8_S23C1_MASK                      equ 0080h
LCDDATA8_SEG16COM1_POSN                  equ 0000h
LCDDATA8_SEG16COM1_POSITION              equ 0000h
LCDDATA8_SEG16COM1_SIZE                  equ 0001h
LCDDATA8_SEG16COM1_LENGTH                equ 0001h
LCDDATA8_SEG16COM1_MASK                  equ 0001h
LCDDATA8_SEG17COM1_POSN                  equ 0001h
LCDDATA8_SEG17COM1_POSITION              equ 0001h
LCDDATA8_SEG17COM1_SIZE                  equ 0001h
LCDDATA8_SEG17COM1_LENGTH                equ 0001h
LCDDATA8_SEG17COM1_MASK                  equ 0002h
LCDDATA8_SEG18COM1_POSN                  equ 0002h
LCDDATA8_SEG18COM1_POSITION              equ 0002h
LCDDATA8_SEG18COM1_SIZE                  equ 0001h
LCDDATA8_SEG18COM1_LENGTH                equ 0001h
LCDDATA8_SEG18COM1_MASK                  equ 0004h
LCDDATA8_SEG19COM1_POSN                  equ 0003h
LCDDATA8_SEG19COM1_POSITION              equ 0003h
LCDDATA8_SEG19COM1_SIZE                  equ 0001h
LCDDATA8_SEG19COM1_LENGTH                equ 0001h
LCDDATA8_SEG19COM1_MASK                  equ 0008h
LCDDATA8_SEG20COM1_POSN                  equ 0004h
LCDDATA8_SEG20COM1_POSITION              equ 0004h
LCDDATA8_SEG20COM1_SIZE                  equ 0001h
LCDDATA8_SEG20COM1_LENGTH                equ 0001h
LCDDATA8_SEG20COM1_MASK                  equ 0010h
LCDDATA8_SEG21COM1_POSN                  equ 0005h
LCDDATA8_SEG21COM1_POSITION              equ 0005h
LCDDATA8_SEG21COM1_SIZE                  equ 0001h
LCDDATA8_SEG21COM1_LENGTH                equ 0001h
LCDDATA8_SEG21COM1_MASK                  equ 0020h
LCDDATA8_SEG22COM1_POSN                  equ 0006h
LCDDATA8_SEG22COM1_POSITION              equ 0006h
LCDDATA8_SEG22COM1_SIZE                  equ 0001h
LCDDATA8_SEG22COM1_LENGTH                equ 0001h
LCDDATA8_SEG22COM1_MASK                  equ 0040h
LCDDATA8_SEG23COM1_POSN                  equ 0007h
LCDDATA8_SEG23COM1_POSITION              equ 0007h
LCDDATA8_SEG23COM1_SIZE                  equ 0001h
LCDDATA8_SEG23COM1_LENGTH                equ 0001h
LCDDATA8_SEG23COM1_MASK                  equ 0080h

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
LCDDATA9                                 equ 0F69h
// bitfield definitions
LCDDATA9_LCDDATA9_POSN                   equ 0000h
LCDDATA9_LCDDATA9_POSITION               equ 0000h
LCDDATA9_LCDDATA9_SIZE                   equ 0008h
LCDDATA9_LCDDATA9_LENGTH                 equ 0008h
LCDDATA9_LCDDATA9_MASK                   equ 00FFh
LCDDATA9_S24C1_POSN                      equ 0000h
LCDDATA9_S24C1_POSITION                  equ 0000h
LCDDATA9_S24C1_SIZE                      equ 0001h
LCDDATA9_S24C1_LENGTH                    equ 0001h
LCDDATA9_S24C1_MASK                      equ 0001h
LCDDATA9_S25C1_POSN                      equ 0001h
LCDDATA9_S25C1_POSITION                  equ 0001h
LCDDATA9_S25C1_SIZE                      equ 0001h
LCDDATA9_S25C1_LENGTH                    equ 0001h
LCDDATA9_S25C1_MASK                      equ 0002h
LCDDATA9_S26C1_POSN                      equ 0002h
LCDDATA9_S26C1_POSITION                  equ 0002h
LCDDATA9_S26C1_SIZE                      equ 0001h
LCDDATA9_S26C1_LENGTH                    equ 0001h
LCDDATA9_S26C1_MASK                      equ 0004h
LCDDATA9_S27C1_POSN                      equ 0003h
LCDDATA9_S27C1_POSITION                  equ 0003h
LCDDATA9_S27C1_SIZE                      equ 0001h
LCDDATA9_S27C1_LENGTH                    equ 0001h
LCDDATA9_S27C1_MASK                      equ 0008h
LCDDATA9_S28C1_POSN                      equ 0004h
LCDDATA9_S28C1_POSITION                  equ 0004h
LCDDATA9_S28C1_SIZE                      equ 0001h
LCDDATA9_S28C1_LENGTH                    equ 0001h
LCDDATA9_S28C1_MASK                      equ 0010h
LCDDATA9_S29C1_POSN                      equ 0005h
LCDDATA9_S29C1_POSITION                  equ 0005h
LCDDATA9_S29C1_SIZE                      equ 0001h
LCDDATA9_S29C1_LENGTH                    equ 0001h
LCDDATA9_S29C1_MASK                      equ 0020h
LCDDATA9_S30C1_POSN                      equ 0006h
LCDDATA9_S30C1_POSITION                  equ 0006h
LCDDATA9_S30C1_SIZE                      equ 0001h
LCDDATA9_S30C1_LENGTH                    equ 0001h
LCDDATA9_S30C1_MASK                      equ 0040h
LCDDATA9_S31C1_POSN                      equ 0007h
LCDDATA9_S31C1_POSITION                  equ 0007h
LCDDATA9_S31C1_SIZE                      equ 0001h
LCDDATA9_S31C1_LENGTH                    equ 0001h
LCDDATA9_S31C1_MASK                      equ 0080h
LCDDATA9_SEG24COM1_POSN                  equ 0000h
LCDDATA9_SEG24COM1_POSITION              equ 0000h
LCDDATA9_SEG24COM1_SIZE                  equ 0001h
LCDDATA9_SEG24COM1_LENGTH                equ 0001h
LCDDATA9_SEG24COM1_MASK                  equ 0001h
LCDDATA9_SEG25COM1_POSN                  equ 0001h
LCDDATA9_SEG25COM1_POSITION              equ 0001h
LCDDATA9_SEG25COM1_SIZE                  equ 0001h
LCDDATA9_SEG25COM1_LENGTH                equ 0001h
LCDDATA9_SEG25COM1_MASK                  equ 0002h
LCDDATA9_SEG26COM1_POSN                  equ 0002h
LCDDATA9_SEG26COM1_POSITION              equ 0002h
LCDDATA9_SEG26COM1_SIZE                  equ 0001h
LCDDATA9_SEG26COM1_LENGTH                equ 0001h
LCDDATA9_SEG26COM1_MASK                  equ 0004h
LCDDATA9_SEG27COM1_POSN                  equ 0003h
LCDDATA9_SEG27COM1_POSITION              equ 0003h
LCDDATA9_SEG27COM1_SIZE                  equ 0001h
LCDDATA9_SEG27COM1_LENGTH                equ 0001h
LCDDATA9_SEG27COM1_MASK                  equ 0008h
LCDDATA9_SEG28COM1_POSN                  equ 0004h
LCDDATA9_SEG28COM1_POSITION              equ 0004h
LCDDATA9_SEG28COM1_SIZE                  equ 0001h
LCDDATA9_SEG28COM1_LENGTH                equ 0001h
LCDDATA9_SEG28COM1_MASK                  equ 0010h
LCDDATA9_SEG29COM1_POSN                  equ 0005h
LCDDATA9_SEG29COM1_POSITION              equ 0005h
LCDDATA9_SEG29COM1_SIZE                  equ 0001h
LCDDATA9_SEG29COM1_LENGTH                equ 0001h
LCDDATA9_SEG29COM1_MASK                  equ 0020h
LCDDATA9_SEG30COM1_POSN                  equ 0006h
LCDDATA9_SEG30COM1_POSITION              equ 0006h
LCDDATA9_SEG30COM1_SIZE                  equ 0001h
LCDDATA9_SEG30COM1_LENGTH                equ 0001h
LCDDATA9_SEG30COM1_MASK                  equ 0040h
LCDDATA9_SEG31COM1_POSN                  equ 0007h
LCDDATA9_SEG31COM1_POSITION              equ 0007h
LCDDATA9_SEG31COM1_SIZE                  equ 0001h
LCDDATA9_SEG31COM1_LENGTH                equ 0001h
LCDDATA9_SEG31COM1_MASK                  equ 0080h

